In [2]:
import pandas as pd

In [3]:
obj = pd.Series([1,9,6,7])

In [4]:
obj

0    1
1    9
2    6
3    7
dtype: int64

In [5]:
obj4 = pd.Series([8,9,7,6], index=['j','n','i','h'])

In [6]:
obj4

j    8
n    9
i    7
h    6
dtype: int64

In [7]:
obj4.index

Index(['j', 'n', 'i', 'h'], dtype='object')

In [8]:
obj4['n']

9

In [9]:
pd.exp(obj4)

AttributeError: module 'pandas' has no attribute 'exp'

In [10]:
import numpy as np

In [11]:
np.exp(obj)

0       2.718282
1    8103.083928
2     403.428793
3    1096.633158
dtype: float64

In [12]:
data = {'pen':'bic','glue':'pritt', 'laptop':'lenovo'}

In [13]:
obj3 = pd.Series(data)

In [14]:
obj3

pen          bic
glue       pritt
laptop    lenovo
dtype: object

In [15]:
items = ['laptop', 'glue','pen']

In [16]:
obj2 = pd.Series(data, index = items)

In [17]:
obj2

laptop    lenovo
glue       pritt
pen          bic
dtype: object

In [18]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
data = {'state': ['liquid', 'gaseous','solid','liquid','gaseous','solid','liquid'],
       'year': [2019,2018,2017,2016,2015,2014,2013],
       'day':[1,7,5,4,10,9,6]}

In [34]:
frame = pd.DataFrame(data, columns = ['year', 'state', 'day', 'debt'])

In [35]:
frame

   year    state  day debt
0  2019   liquid    1  NaN
1  2018  gaseous    7  NaN
2  2017    solid    5  NaN
3  2016   liquid    4  NaN
4  2015  gaseous   10  NaN
5  2014    solid    9  NaN
6  2013   liquid    6  NaN

In [32]:
frame.head()

   year    state  day
0  2019   liquid    1
1  2018  gaseous    7
2  2017    solid    5
3  2016   liquid    4
4  2015  gaseous   10

In [33]:
frame.loc[2]

year      2017
state    solid
day          5
Name: 2, dtype: object

In [38]:
frame.debt = np.arange(7)

In [39]:
frame

   year    state  day  debt
0  2019   liquid    1     0
1  2018  gaseous    7     1
2  2017    solid    5     2
3  2016   liquid    4     3
4  2015  gaseous   10     4
5  2014    solid    9     5
6  2013   liquid    6     6

In [50]:
frame.debt = np.random.randn(7)

In [51]:
frame

   year    state  day      debt
0  2019   liquid    1  0.296334
1  2018  gaseous    7 -0.244777
2  2017    solid    5  0.019492
3  2016   liquid    4 -3.069442
4  2015  gaseous   10 -1.143390
5  2014    solid    9  0.948395
6  2013   liquid    6  0.112461

In [52]:
del frame['debt']

In [53]:
frame

   year    state  day
0  2019   liquid    1
1  2018  gaseous    7
2  2017    solid    5
3  2016   liquid    4
4  2015  gaseous   10
5  2014    solid    9
6  2013   liquid    6

In [54]:
pop = {'Rwanda': {2001: 2.4, 2002: 1.9},
       'Uganda':{2000:5.3,2001:8.9,2002:6.6}}

In [59]:
dframe = pd.DataFrame(pop)

In [60]:
dframe

      Rwanda  Uganda
2001     2.4     8.9
2002     1.9     6.6
2000     NaN     5.3

In [61]:
158-136

22

In [62]:
136-124

12

In [63]:
26-12

14

In [64]:
124+26

150